#задача 1 
x = int(input("введите число: "))
y = 7 * x + 5
print("ответ: y = ",y)

#задача 2 
a = int(input("введите число: "))
p = 4 * a 
print("ответ: p = ",p)

#задача 3
r = int(input("введите число: "))
l = 3.14 * 2 * r
print("ответ: l = ",l)

#задача 4 
d = int(input("введите число: "))
s = 3.14 * (d**2) / 4
print("ответ: s = ",s)

#задача 5 
a = int(input("введите 1 катет: "))
b = int(input("введите 2 катет: "))
c = (a**2 + b**2)**0.5
print("ответ: c = ",c)

#задача 6 
a = int(input("введите 1 катет: "))
b = int(input("введите 2 катет: "))
c = (a**2 + b**2)**0.5
p = a + b + c 
print("ответ: p = ",p)

#задача 7 
a = int(input("введите 1 сторону: "))
b = int(input("введите 2 сторону: "))
p = (a + b)* 2
d = (a**2 + b**2)**0.5
print("периметр: ",p, '\n' + "диагональ: ",d)

#задача 8 
r1 = int(input("введите 1 радиус: "))
r2 = int(input("введите 2 радиус: "))
s = (r1**2 * 3.14) - (r2**2 * 3.14)
print("ответ: s = ",s)

#задача 9 
a = int(input("введите число: "))
s = 6 * r**2
v = r**3 
print("площадь: ",s, '\n' + "объем: ",v)

#задача 10 
a = int(input("введите 1 основание: "))
b = int(input("введите 2 основание "))
h = int(input("введите высоту: "))
bok = ((b - a)**2 + h**2)**0.5
p = a + b + h + bok * 2 
print("ответ: p = ",p)
